package hm_day6.Test1;
/*
    1. 一个类与它的对象之间是什么关系？  
        类是对象的模板，对象是类的实体
        在面向对象的开发中：必须先有类，才能创建类具体的对象。类与对象即可组成万千事物，软 件就可以以此模拟现实世界的业务功能了。
    2. 如何定义一个类，由哪些部分组成，各个部分的作用是什么？  
        修饰符 类名 {
            成员变量:表示事物的属性
            成员方法:表示事物的行为
            构造方法/构造器/构造函数:给对象初始化
            内部类
            代码块
        }
    3. 如何创建一个对象，如何使用该对象？
        创建对象格式:
            数据类型 变量名 = new 构造器;
        对象使用方式:
            变量名.实例变量/实例方法
            变量名.静态变量/静态方法。
 
    4. 局部变量和成员变量的区别？
        在类中的位置不同
            成员变量：类中，方法外
            局部变量：方法中或者方法声明上(形式参数)
        作用范围不一样
            成员变量：类中
            局部变量：方法中
        初始化值的不同
            成员变量：有默认值
            局部变量：没有默认值。
        在内存中的位置不同
            成员变量：堆内存
            局部变量：栈内存
        生命周期不同
            成员变量：随着对象的创建而存在，随着对象的消失而消失
            局部变量：随着方法的调用而存在，随着方法的调用完毕而消失
 */
public class gainian {
}
