package hm_day7;
/*
    能够理解private关键字的含义
    private: 私有, 只有本类能使用

    能够说出this关键字可以解决的问题
        用于成员变量和局部变量重名时
            this.变量名代表成员变量

    能够用封装的思想定义一个标准类
        1.成员变量私有 (自己写)
        2.提供getter/setter方法 (alt + insert)
        3.无参构造(必须有) (alt + insert)
        4.有参构造(建议有) (alt + insert)
        5.成员方法 (自己写)

    能够写出类的继承格式
        class 类名 extends 父类名 {
        }

    能够说出继承的特点
        1.Java中类只能单继承(一个类只有一个父类)
        2.一个类可以有多个子类
        3.可以多层继承(父类,子类,孙子)

    能够说出子类调用父类的成员特点
        就近原则,先找自己的,自己没有找父类的

    够说出方法重写的概念
        子类的方法和父类的方法"一模一样"

    能够说出this可以解决的问题
        this代表本类, 会找本类的内容

    能够说出super可以解决的问题
        super代表父类,会找父类的内容
 */
public class hm_12_总结 {
}
